Repository: xjxtree/agent-pet-companion
Catalog: apps/macos/Sources/AgentPetCompanion/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# studio.session.incomplete_history_detail
source: PetCore recorded this session as completed, but its result pet is unavailable. No library item or result metadata can be shown safely.
zh_hans: PetCore 已记录此会话完成，但结果宠物不可用，因此无法安全显示宠物库入口或结果元数据。

# studio.session.incomplete_history_title
source: Completed Session History Is Incomplete
zh_hans: 完成记录不完整

# studio.session.output_contract_detail
source: The result must include idle, thinking, tool, waiting, done, and failed; every state uses explicit per-frame timing and playback without runtime retiming.
zh_hans: 生成结果必须包含 idle、thinking、tool、waiting、done、failed 六个状态；每个状态使用显式逐帧时序与播放方式，运行时不会重定时。

# studio.session.output_contract_title
source: Output Contract
zh_hans: 输出合同

# studio.session.output_privacy
source: Only task-scoped safe copies are used. Unvalidated assets never enter the pet library.
zh_hans: 仅使用任务所需的安全副本；未经校验的资产不会进入宠物库。

# studio.session.preparing
source: Preparing the local session…
zh_hans: 正在准备本地会话…

# studio.session.succeeded_title
source: Validated and Added
zh_hans: 已校验并入库

# studio.session.view_library
source: View in Pet Library
zh_hans: 在宠物库中查看

# studio.session.welcome_detail
source: Complete the creation brief, then start making your pet.
zh_hans: 完成创作 brief 后开始制作。

# studio.session.welcome_title
source: Ready to Create
zh_hans: 准备开始

# studio.stage.complete
source: Complete
zh_hans: 已完成

# studio.stage.current
source: Current stage
zh_hans: 当前阶段

# studio.stage.failed
source: Incomplete
zh_hans: 未完成

# studio.stage.unrecorded
source: Not recorded
zh_hans: 未记录

# studio.stage.upcoming
source: Not started
zh_hans: 尚未开始

# studio.step.baseline
source: Baseline
zh_hans: 基线

# studio.step.brief
source: Brief
zh_hans: 需求

# studio.step.generation
source: Generation
zh_hans: 生成

# studio.step.library
source: Library
zh_hans: 入库

# studio.step.revision
source: Revision
zh_hans: 修订

# studio.step.validation
source: Validation
zh_hans: 校验

# studio.submitted.pending
source: Waiting for the submitted brief
zh_hans: 等待已提交需求

# studio.submitted.title
source: Submitted Brief
zh_hans: 已提交需求

# studio.subtitle.cancelled
source: The task was cancelled. Unvalidated assets were not added to the library.
zh_hans: 任务已取消，未验证资产没有写入宠物库

# studio.subtitle.failed
source: The task did not finish. Your input and current pet revision are preserved.
zh_hans: 任务未完成，输入和当前宠物 revision 均已保留

# studio.subtitle.idle
source: Define the brief, then create and validate a .petpack in a local AI session.
zh_hans: 先定义创作需求，再由本地 AI 会话生成并校验 .petpack

# studio.subtitle.succeeded
source: Review the result and choose what happens next.
zh_hans: 查看制作结果并决定下一步。

# studio.success.generic
source: Validated as a .petpack and added to the local pet library.
zh_hans: 已通过 .petpack 校验并写入本地宠物库。

# studio.success.pet_id
source: Pet ID
zh_hans: 宠物 ID

# studio.success.revision
source: New revision
zh_hans: 新 revision

# studio.success.revision_format
source: Committed an immutable new revision · %@
zh_hans: 已提交不可变的新 revision · %@

# studio.success.validation
source: Validation
zh_hans: 校验摘要

# studio.success.validation_format
source: %d states · %d frames · %d warnings
zh_hans: %d 个状态 · %d 帧 · %d 个警告

# style.anime
source: Anime
zh_hans: 动漫

# style.modern
source: Modern
zh_hans: 现代

# style.pixel
source: Pixel art
zh_hans: 像素

# style.realistic
source: Realistic
zh_hans: 写实

# style.semi_realistic
source: Semi-realistic
zh_hans: 半写实

# style.unspecified
source: No preference
zh_hans: 不指定

# verification_status.action_required
source: Action required
zh_hans: 需操作

# verification_status.not_required
source: Not required
zh_hans: 无需验证

# verification_status.unverified
source: Awaiting verification
zh_hans: 待验证

# studio.brief.description_templates_title
source: Brief prompts
zh_hans: 描述提示

# studio.brief.template.appearance.title
source: Appearance
zh_hans: 外观

# studio.brief.template.appearance.prompt
source: Appearance: a small, rounded companion with expressive ears.
zh_hans: 外观：小巧圆润，耳朵表情丰富。

# studio.brief.template.action.title
source: Actions
zh_hans: 动作

# studio.brief.template.action.prompt
source: Actions: gentle breathing at idle and focused gestures while working.
zh_hans: 动作：待机时轻柔呼吸，工作时有专注手势。

# studio.brief.template.palette.title
source: Colors
zh_hans: 配色

# studio.brief.template.palette.prompt
source: Colors: warm orange with teal highlights.
zh_hans: 配色：暖橙色搭配青绿色点缀。

# studio.brief.description_count_format
source: %d/%d characters
zh_hans: %d/%d 字

# studio.history.filter.label
source: Filter creation history
zh_hans: 筛选制作记录

# studio.history.filter.all
source: All
zh_hans: 全部

# studio.history.filter.succeeded
source: Succeeded
zh_hans: 成功

# studio.history.filter.failed
source: Failed
zh_hans: 失败

# studio.history.filter.cancelled
source: Cancelled
zh_hans: 已取消

# studio.history.filter.empty
source: No tasks match this filter.
zh_hans: 此筛选条件下暂无任务。

# studio.history.style_tag_format
source: Style: %@
zh_hans: 风格：%@

# studio.history.quality_tag_format
source: Quality: %@
zh_hans: 画质：%@

# studio.history.retry_badge
source: Retry
zh_hans: 重试

# studio.history.actions
source: Task Actions
zh_hans: 任务操作

# studio.history.copy_brief
source: Copy Brief to New Task
zh_hans: 复制 brief 新建任务

# studio.history.copy_brief_success
source: Copied the brief into a new task.
zh_hans: 已将 brief 回填到新任务。

# studio.history.copy_brief_unavailable
source: Finish or cancel the current task before copying this brief.
zh_hans: 请先完成或取消当前任务，再复制此 brief。

# studio.history.copy_brief_references_notice_format
source: This task used %d reference image(s). For privacy, choose them again before starting the new task.
zh_hans: 此任务使用了 %d 张参考图。出于隐私保护，新任务开始前请重新选择。

# studio.history.result_pet_title
source: Result Pet
zh_hans: 结果宠物

# studio.history.result_pet_missing
source: This task succeeded, but its result pet is no longer in the library.
zh_hans: 此任务已成功，但结果宠物已不在宠物库中。

# studio.history.view_pet
source: View in Pet Library
zh_hans: 在宠物库中查看

# studio.history.enable_pet
source: Use This Pet
zh_hans: 启用此宠物

# studio.history.enabling_pet
source: Enabling pet…
zh_hans: 正在启用宠物…

# studio.history.delete.action
source: Delete Record
zh_hans: 删除记录

# studio.history.delete.confirm_title
source: Delete this creation record?
zh_hans: 删除这条制作记录？

# studio.history.delete.confirm_detail
source: The saved task and its private workspace will be removed. A pet already added to Pet Library is kept. This cannot be undone.
zh_hans: 已保存的任务及其私有工作区将被移除；已经加入宠物库的宠物会保留。此操作无法撤销。

# studio.history.delete.confirm_action
source: Delete Record
zh_hans: 删除记录

# studio.history.context_menu
source: Creation Record Actions
zh_hans: 制作记录操作

# studio.session.start_blocking_title
source: Before You Can Start
zh_hans: 开始前还需完成

# studio.session.start_bottom_hint
source: Start when the brief and local Codex check are ready.
zh_hans: 创作 brief 与本地 Codex 检查就绪后即可开始制作。

# studio.history.retry_unavailable
source: Finish or cancel the current task before retrying this brief.
zh_hans: 请先完成或取消当前任务，再使用此 brief 重试。

# studio.history.retry_starting.create
source: Starting a new task from this brief…
zh_hans: 正在使用此 brief 创建新任务…

# studio.history.retry_starting.modify
source: Starting a new revision task from this brief…
zh_hans: 正在使用此 brief 创建新的修改任务…

# studio.history.delete.success
source: Deleted the creation record.
zh_hans: 已删除制作记录。

# studio.history.delete.refresh_warning
source: Deleted the creation record, but the history list could not be refreshed.
zh_hans: 制作记录已删除，但未能刷新记录列表。

# studio.history.delete.failed_format
source: Could not delete the creation record: %@
zh_hans: 无法删除制作记录：%@

# studio.history.delete.invalid_response
source: PetCore did not confirm that the creation record was deleted.
zh_hans: PetCore 未确认制作记录已删除。

# verification_status.verified
source: Verified
zh_hans: 已验证

# studio.workspace.active_task_blocks_new
source: Finish or cancel the current creation task first.
zh_hans: 请先完成或取消当前制作任务。

# studio.workspace.draft_subtitle
source: Draft · Timer not started
zh_hans: 草稿 · 尚未计时

# studio.workspace.load_older
source: Load Earlier Messages
zh_hans: 加载更早消息

# studio.workspace.new_messages
source: New Messages
zh_hans: 有新消息

# studio.workspace.user_name
source: You
zh_hans: 你

# studio.workspace.agent_name
source: AI Pet Maker
zh_hans: AI 宠物制作

# studio.workspace.needs_decision
source: Your Decision Is Needed
zh_hans: 需要你的判断

# studio.workspace.reply_hint
source: Your reply continues this same creation task.
zh_hans: 回复后将继续同一制作任务。

# studio.workspace.resume_hint
source: Add an optional correction, then continue from the saved checkpoint.
zh_hans: 可以补充修正指令，再从已保存的检查点继续。

# studio.workspace.reply_placeholder
source: Enter your answer
zh_hans: 输入你的回答

# studio.workspace.resume_placeholder
source: Optional continuation or correction instructions
zh_hans: 输入可选的继续或修正指令

# studio.workspace.send
source: Send
zh_hans: 发送

# studio.workspace.continue
source: Continue
zh_hans: 继续

# studio.workspace.cancel_cleanup
source: Stopping execution and archiving its conversation…
zh_hans: 正在停止执行并归档对应会话…

# studio.workspace.running_hint
source: Creation is in progress and does not need a reply. You can cancel at any time.
zh_hans: 当前正在制作，无需回复；你可以随时取消任务。

# studio.workspace.canceled_hint
source: This task is canceled. Its timer and underlying conversation have stopped.
zh_hans: 任务已取消，计时和底层会话均已终止。

# studio.workspace.non_resumable_failure_hint
source: This failure has no resumable checkpoint, so it cannot continue in the original creation session. Use the actions below the conversation to view the preserved ChatGPT conversation or copy the brief into a new task.
zh_hans: 这条失败记录没有可恢复检查点，无法在原制作会话中继续。你仍可使用会话下方的操作查看保留的 ChatGPT 会话，或复制 brief 新建任务。

# studio.workspace.status.cancel_cleanup
source: Finishing Cancellation
zh_hans: 取消清理中

# studio.workspace.status.recoverable
source: Can Continue
zh_hans: 可继续

# studio.workspace.status.paused
source: Paused · Can Continue
zh_hans: 中断待继续

# studio.workspace.status.failed_recoverable
source: Failed · Can Continue
zh_hans: 失败，可继续

# studio.notification.waiting.title
source: AI Pet Maker Needs Your Decision
zh_hans: AI 宠物制作需要你的判断

# studio.notification.waiting.body
source: Open the creation task and reply to continue.
zh_hans: 打开制作会话并回复后，任务会继续。

# studio.notification.paused.title
source: AI Pet Maker Was Interrupted
zh_hans: AI 宠物制作已中断

# studio.notification.paused.body
source: You can continue from the saved checkpoint.
zh_hans: 可从已保存检查点继续。

# studio.notification.recoverable.title
source: AI Pet Maker Can Continue
zh_hans: AI 宠物制作可继续

# studio.notification.recoverable.body
source: Add correction instructions, then continue.
zh_hans: 可输入修正指令后继续。

# studio.notification.completed.title
source: AI Pet Maker Finished
zh_hans: AI 宠物制作完成

# studio.notification.completed.body
source: Your pet passed validation and is ready to view.
zh_hans: 宠物已通过验证，可以查看结果。

# studio.notification.failed.title
source: AI Pet Maker Failed
zh_hans: AI 宠物制作失败

# studio.notification.failed.body
source: This task cannot recover in place; open it for details.
zh_hans: 该任务无法原地恢复，可查看详情。

# studio.workspace.history_count_format
source: %d tasks
zh_hans: 共 %d 条

# studio.workspace.page_subtitle
source: Manage creation history, progress, and conversation records.
zh_hans: 管理制作历史，查看进度与会话记录

# studio.workspace.recent
source: Recent
zh_hans: 最近

# studio.workspace.discard_draft
source: Discard Draft
zh_hans: 放弃草稿
